id: t1110-password-spray-vpn
name: Password Spray (vpn)
query: |
  CommonSecurityLog
  | where DeviceAction != Allow
  | summarize fail_count=count() by SourceUserName, bin(TimeGenerated, 15m)
  | where fail_count >= 10
metadata:
  name: Password Spray (vpn)
  template_id: t1110-password-spray
  source: vpn
  mitre_techniques:
    - T1110
  owner:
    team: detection-engineering
    slack: "#soc-detections"
    oncall: sec-detect-oncall
